Revit 2027 API
ExportColumnHeaders Enumeration
 Options for exporting column headers in schedule view export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ExportColumnHeaders
Public Enumeration ExportColumnHeaders
public enum class ExportColumnHeaders
type ExportColumnHeaders
Members
Member name | Value | Description
MultipleRows | 2 |  Both column headers and grouped header cells are exported.
None | 0 |  Do not export column headers.
OneRow | 1 |  Export the column headers only.
See Also
Reference
Autodesk.Revit.DB Namespace